const {
    表达单层缩进之字符串,
    表达双层缩进之字符串,
} = require('../../../静态-html-片段以及动态构建的-html-片段/以-javascript-字符串形式给出的-html-片段集/表达源代码缩进之字符串')

module.exports = function 将字符串用HTML标签包裹起来得出另一字符串({
    原始字符串,
    用于包裹原始字符串之HTML标签名,
    包裹原始内容后原始应逐行额外缩进两层,
}) {
    if (!原始字符串.trim()) {
        return ''
    }

    let 处理后的纯内容字符串 = 原始字符串
    if (包裹原始内容后原始应逐行额外缩进两层) {
        处理后的纯内容字符串 = 处理后的纯内容字符串
            .replace(/\n/g, `\n${表达双层缩进之字符串}`)
            .replace(/\n{2,}/g, '\n')
    }

    return [
        `\n${表达单层缩进之字符串}<${用于包裹原始字符串之HTML标签名}>\n`,

        表达双层缩进之字符串,

        处理后的纯内容字符串,

        `\n${表达单层缩进之字符串}</${用于包裹原始字符串之HTML标签名}>`,
    ].join('')
}
